aws/amazon-freertos/vendors/renesas/FIT/RDP_v1.15_modified/r_sci_iic_rx/src/targets/rx63n/r_sci_iic_rx63n.c
    #if SCI_IIC_CFG_CH6_INCLUDED
/***********************************************************************************************************************
 * Function Name: sci_iic_int_sci_iic6_tei_isr
 * Description  : Interrupt TEI handler for channel 6.
 *                Types of interrupt requests transfer error or event generation.
 *              : The event generations are arbitration-lost, NACK detection, timeout detection, 
 *              : start condition detection, and stop condition detection.
 * Arguments    : None
 * Return Value : None
 **********************************************************************************************************************/
R_PRAGMA_STATIC_INTERRUPT(sci_iic_int_sci_iic6_tei_isr, VECT_SCI6_TEI6)
R_ATTRIB_STATIC_INTERRUPT void sci_iic_int_sci_iic6_tei_isr (void)
{
    r_sci_iic_tei_isr_processing(SCI_IIC_NUM_CH6);

    /* Calls advance function */
    r_sci_iic_advance(g_sci_iic_handles[SCI_IIC_NUM_CH6]->psci_iic_info_ch);
} /* End of function sci_iic_int_sci_iic6_tei_isr() */
    #endif

    #if SCI_IIC_CFG_CH7_INCLUDED
/***********************************************************************************************************************
 * Function Name: sci_iic_int_sci_iic7_tei_isr
 * Description  : Interrupt TEI handler for channel 7.
 *                Types of interrupt requests transfer error or event generation.
 *              : The event generations are arbitration-lost, NACK detection, timeout detection, 
 *              : start condition detection, and stop condition detection.
 * Arguments    : None
 * Return Value : None
 **********************************************************************************************************************/
R_PRAGMA_STATIC_INTERRUPT(sci_iic_int_sci_iic7_tei_isr, VECT_SCI7_TEI7)
R_ATTRIB_STATIC_INTERRUPT void sci_iic_int_sci_iic7_tei_isr (void)
{
    r_sci_iic_tei_isr_processing(SCI_IIC_NUM_CH7);

    /* Calls advance function */
    r_sci_iic_advance(g_sci_iic_handles[SCI_IIC_NUM_CH7]->psci_iic_info_ch);
} /* End of function sci_iic_int_sci_iic7_tei_isr() */
    #endif

    #if SCI_IIC_CFG_CH8_INCLUDED
/***********************************************************************************************************************
 * Function Name: sci_iic_int_sci_iic8_tei_isr
 * Description  : Interrupt TEI handler for channel 8.
 *                Types of interrupt requests transfer error or event generation.
 *              : The event generations are arbitration-lost, NACK detection, timeout detection, 
 *              : start condition detection, and stop condition detection.
 * Arguments    : None
 * Return Value : None
 **********************************************************************************************************************/
R_PRAGMA_STATIC_INTERRUPT(sci_iic_int_sci_iic8_tei_isr, VECT_SCI8_TEI8)
R_ATTRIB_STATIC_INTERRUPT void sci_iic_int_sci_iic8_tei_isr (void)
{
    r_sci_iic_tei_isr_processing(SCI_IIC_NUM_CH8);

    /* Calls advance function */
    r_sci_iic_advance(g_sci_iic_handles[SCI_IIC_NUM_CH8]->psci_iic_info_ch);
} /* End of function sci_iic_int_sci_iic8_tei_isr() */
    #endif

    #if SCI_IIC_CFG_CH9_INCLUDED
/***********************************************************************************************************************
 * Function Name: sci_iic_int_sci_iic9_tei_isr
 * Description  : Interrupt TEI handler for channel 9.
 *                Types of interrupt requests transfer error or event generation.
 *              : The event generations are arbitration-lost, NACK detection, timeout detection, 
 *              : start condition detection, and stop condition detection.
 * Arguments    : None
 * Return Value : None
 **********************************************************************************************************************/
R_PRAGMA_STATIC_INTERRUPT(sci_iic_int_sci_iic9_tei_isr, VECT_SCI9_TEI9)
R_ATTRIB_STATIC_INTERRUPT void sci_iic_int_sci_iic9_tei_isr (void)
{
    r_sci_iic_tei_isr_processing(SCI_IIC_NUM_CH9);

    /* Calls advance function */
    r_sci_iic_advance(g_sci_iic_handles[SCI_IIC_NUM_CH9]->psci_iic_info_ch);
} /* End of function sci_iic_int_sci_iic9_tei_isr() */
    #endif

    #if SCI_IIC_CFG_CH10_INCLUDED
/***********************************************************************************************************************
 * Function Name: sci_iic_int_sci_iic10_tei_isr
 * Description  : Interrupt TEI handler for channel 10.
 *                Types of interrupt requests transfer error or event generation.
 *              : The event generations are arbitration-lost, NACK detection, timeout detection, 
 *              : start condition detection, and stop condition detection.
 * Arguments    : None
 * Return Value : None
 **********************************************************************************************************************/
R_PRAGMA_STATIC_INTERRUPT(sci_iic_int_sci_iic10_tei_isr, VECT_SCI10_TEI10)
R_ATTRIB_STATIC_INTERRUPT void sci_iic_int_sci_iic10_tei_isr (void)
{
    r_sci_iic_tei_isr_processing(SCI_IIC_NUM_CH10);

    /* Calls advance function */
    r_sci_iic_advance(g_sci_iic_handles[SCI_IIC_NUM_CH10]->psci_iic_info_ch);
} /* End of function sci_iic_int_sci_iic10_tei_isr() */
    #endif

    #if SCI_IIC_CFG_CH11_INCLUDED
/***********************************************************************************************************************
 * Function Name: sci_iic_int_sci_iic11_tei_isr
 * Description  : Interrupt TEI handler for channel 11.
 *                Types of interrupt requests transfer error or event generation.
 *              : The event generations are arbitration-lost, NACK detection, timeout detection, 
 *              : start condition detection, and stop condition detection.
 * Arguments    : None
 * Return Value : None
 **********************************************************************************************************************/
R_PRAGMA_STATIC_INTERRUPT(sci_iic_int_sci_iic11_tei_isr, VECT_SCI11_TEI11)
R_ATTRIB_STATIC_INTERRUPT void sci_iic_int_sci_iic11_tei_isr (void)
{
    r_sci_iic_tei_isr_processing(SCI_IIC_NUM_CH11);

    /* Calls advance function */
    r_sci_iic_advance(g_sci_iic_handles[SCI_IIC_NUM_CH11]->psci_iic_info_ch);
} /* End of function sci_iic_int_sci_iic11_tei_isr() */
    #endif

    #if SCI_IIC_CFG_CH12_INCLUDED
/***********************************************************************************************************************
 * Function Name: sci_iic_int_sci_iic12_tei_isr
 * Description  : Interrupt TEI handler for channel 12.
 *                Types of interrupt requests transfer error or event generation.
 *              : The event generations are arbitration-lost, NACK detection, timeout detection, 
 *              : start condition detection, and stop condition detection.
 * Arguments    : None
 * Return Value : None
 **********************************************************************************************************************/
R_PRAGMA_STATIC_INTERRUPT(sci_iic_int_sci_iic12_tei_isr, VECT_SCI12_TEI12)
R_ATTRIB_STATIC_INTERRUPT void sci_iic_int_sci_iic12_tei_isr (void)
{
    r_sci_iic_tei_isr_processing(SCI_IIC_NUM_CH12);

    /* Calls advance function */
    r_sci_iic_advance(g_sci_iic_handles[SCI_IIC_NUM_CH12]->psci_iic_info_ch);
} /* End of function sci_iic_int_sci_iic12_tei_isr() */
    #endif

#endif /* BSP_MCU_RX63N */

